RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal_mdios.c
      case HAL_MDIOS_ERROR_CB_ID :
        hmdios->ErrorCallback = pCallback;
        break;

      case HAL_MDIOS_WAKEUP_CB_ID :
        hmdios->WakeUpCallback = pCallback;
        break;

      case HAL_MDIOS_MSPINIT_CB_ID :
        hmdios->MspInitCallback = pCallback;
        break;

      case HAL_MDIOS_MSPDEINIT_CB_ID :
        hmdios->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code */
        hmdios->ErrorCode |= HAL_MDIOS_ERROR_INVALID_CALLBACK;
        /* Return error status */
        status =  HAL_ERROR;
        break;
    }
  }
  else if (hmdios->State == HAL_MDIOS_STATE_RESET)
  {
    switch (CallbackID)
    {
      case HAL_MDIOS_MSPINIT_CB_ID :
        hmdios->MspInitCallback = pCallback;
        break;

      case HAL_MDIOS_MSPDEINIT_CB_ID :
        hmdios->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code */
        hmdios->ErrorCode |= HAL_MDIOS_ERROR_INVALID_CALLBACK;
        /* Return error status */
        status =  HAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    hmdios->ErrorCode |= HAL_MDIOS_ERROR_INVALID_CALLBACK;
    /* Return error status */
    status =  HAL_ERROR;
  }

  /* Release Lock */
  __HAL_UNLOCK(hmdios);

  return status;
}

/**
  * @brief  Unregister an MDIOS Callback
  *         MDIOS callback is redirected to the weak predefined callback
  * @param hmdios mdios handle
  * @param CallbackID ID of the callback to be unregistered
  *        This parameter can be one of the following values:
  *          @arg @ref HAL_MDIOS_WRITE_COMPLETE_CB_ID Write Complete Callback ID
  *          @arg @ref HAL_MDIOS_READ_COMPLETE_CB_ID  Read Complete Callback ID
  *          @arg @ref HAL_MDIOS_ERROR_CB_ID          Error Callback ID
  *          @arg @ref HAL_MDIOS_WAKEUP_CB_ID         Wake Up Callback ID
  *          @arg @ref HAL_MDIOS_MSPINIT_CB_ID        MspInit callback ID
  *          @arg @ref HAL_MDIOS_MSPDEINIT_CB_ID      MspDeInit callback ID
  * @retval status
  */
HAL_StatusTypeDef HAL_MDIOS_UnRegisterCallback(MDIOS_HandleTypeDef *hmdios, HAL_MDIOS_CallbackIDTypeDef CallbackID)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Process locked */
  __HAL_LOCK(hmdios);

  if (hmdios->State == HAL_MDIOS_STATE_READY)
  {
    switch (CallbackID)
    {
      case HAL_MDIOS_WRITE_COMPLETE_CB_ID :
        hmdios->WriteCpltCallback = HAL_MDIOS_WriteCpltCallback;
        break;

      case HAL_MDIOS_READ_COMPLETE_CB_ID :
        hmdios->ReadCpltCallback = HAL_MDIOS_ReadCpltCallback;
        break;

      case HAL_MDIOS_ERROR_CB_ID :
        hmdios->ErrorCallback = HAL_MDIOS_ErrorCallback;
        break;

      case HAL_MDIOS_WAKEUP_CB_ID :
        hmdios->WakeUpCallback = HAL_MDIOS_WakeUpCallback;
        break;

      case HAL_MDIOS_MSPINIT_CB_ID :
        hmdios->MspInitCallback = HAL_MDIOS_MspInit;
        break;

      case HAL_MDIOS_MSPDEINIT_CB_ID :
        hmdios->MspDeInitCallback = HAL_MDIOS_MspDeInit;
        break;

      default :
        /* Update the error code */
        hmdios->ErrorCode |= HAL_MDIOS_ERROR_INVALID_CALLBACK;
        /* Return error status */
        status =  HAL_ERROR;
        break;
    }
  }
  else if (hmdios->State == HAL_MDIOS_STATE_RESET)
  {
    switch (CallbackID)
    {
      case HAL_MDIOS_MSPINIT_CB_ID :
        hmdios->MspInitCallback = HAL_MDIOS_MspInit;
        break;

      case HAL_MDIOS_MSPDEINIT_CB_ID :
        hmdios->MspDeInitCallback = HAL_MDIOS_MspDeInit;
        break;

      default :
        /* Update the error code */
        hmdios->ErrorCode |= HAL_MDIOS_ERROR_INVALID_CALLBACK;
        /* Return error status */
        status =  HAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    hmdios->ErrorCode |= HAL_MDIOS_ERROR_INVALID_CALLBACK;
    /* Return error status */
    status =  HAL_ERROR;
  }

  /* Release Lock */
  __HAL_UNLOCK(hmdios);

  return status;
}
#endif /* USE_HAL_MDIOS_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @defgroup MDIOS_Exported_Functions_Group2 IO operation functions
  *  @brief MDIOS Read/Write functions
  *
@verbatim
 ===============================================================================
                      ##### IO operation functions #####
 ===============================================================================
    This subsection provides a set of functions allowing to manage the MDIOS
    read and write operations.

    (#) APIs that allow to the MDIOS to read/write from/to the
        values of one of the DINn/DOUTn registers:
        (+) Read the value of a DINn register: HAL_MDIOS_ReadReg()
        (+) Write a value to a DOUTn register: HAL_MDIOS_WriteReg()

    (#) APIs that provide if there are some Slave registres have been
        read or written by the Master:
        (+) DOUTn registers read by Master: HAL_MDIOS_GetReadRegAddress()
        (+) DINn registers written by Master : HAL_MDIOS_GetWrittenRegAddress()

    (#) APIs that Clear the read/write flags:
        (+) Clear read registers flags: HAL_MDIOS_ClearReadRegAddress()
        (+) Clear write registers flags: HAL_MDIOS_ClearWriteRegAddress()

    (#) A set of Callbacks are provided:
        (+) HAL_MDIOS_WriteCpltCallback()
        (+) HAL_MDIOS_ReadCpltCallback()
        (+) HAL_MDIOS_ErrorCallback()

@endverbatim
  * @{
  */

/**
  * @brief  Writes to an MDIOS output register
  * @param  hmdios: mdios handle
  * @param  RegNum: MDIOS output register address
  * @param  Data: Data to write
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MDIOS_WriteReg(MDIOS_HandleTypeDef *hmdios, uint32_t RegNum, uint16_t Data)
{
  uint32_t tmpreg;

  /* Check the parameters */
  assert_param(IS_MDIOS_REGISTER(RegNum));

  /* Process Locked */
  __HAL_LOCK(hmdios);

  /* Get the addr of output register to be written by the MDIOS */
  tmpreg = MDIOS_DOUT_BASE_ADDR + (4U * RegNum);

  /* Write to DOUTn register */
  *((uint32_t *)tmpreg) = Data;

  /* Process Unlocked */
  __HAL_UNLOCK(hmdios);

  return HAL_OK;
}

/**
  * @brief  Reads an MDIOS input register
  * @param  hmdios: mdios handle
  * @param  RegNum: MDIOS input register address
  * @param  pData: pointer to Data
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MDIOS_ReadReg(MDIOS_HandleTypeDef *hmdios, uint32_t RegNum, uint16_t *pData)
{
  uint32_t tmpreg;

  /* Check the parameters */
  assert_param(IS_MDIOS_REGISTER(RegNum));

  /* Process Locked */
  __HAL_LOCK(hmdios);

  /* Get the addr of input register to be read by the MDIOS */
  tmpreg = MDIOS_DIN_BASE_ADDR + (4U * RegNum);

